h-3-45deg/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0.01500;

boundaryField
{
    inlet
    {
        type calculated;
        value uniform 0.01500;
    }

    outlet
    {
        type zeroGradient;
    }

    ground
    {
        type nutkWallFunction;
        value uniform 0.0;
    }

    sky
    {
        type calculated;
        value uniform 0.01500;
    }

    side_d
    {
        type symmetryPlane;
    }

    side_e
    {
        type symmetryPlane;
    }

    body
    {
        type nutkWallFunction;
        value uniform 0.0;
    }
    
    neighborhood
    {
        type nutkWallFunction;
        value uniform 0.0;
    }
}

// ************************************************************************* //
